namespace lesson38
{
    internal class Program
    {
        static void Foo(int value)
        {
            value = 5; 
            //після завершення виклику в main значення 5 повертається в локальну змінну,
            //бо змінна видаляється зі стека
            //вона існує до того моменту, поки виконується метод Foo
        }

        static void Bar(int[] arr)
        //копіюється посилання на дані в керованій купі
        {
            arr[0] = 5;
            //через скопійоване посилання (параметр)
            //звертаємось до тих же даних, на які посилається int[] arr4 = new int[1];
            //та поміщаємо туди 5
        }

        static void Main(string[] args)
        {
            //стек - область оперативки, використовує малий об'єм пам'яті
            //купа - область оперативки, використовує великий об'єм пам'яті

            //стек виділяється для кожного потоку - 1 МБ
            //стек використовується для зберігання, виконання операцій над змінними та для виклику методів
            //стек - для виконання логіки програми

            //купа - "склад" оперативки, який використовується по мірі потреби
            //об'єм оперативки для купи залежить від апаратної платформи, ос
            //якщо процес 32-розрядний, для кучі можна виділити +-1.5 ГБ
            //якщо процес 64-розрядний, для кучі можна виділити до 8 ТБ

            //в стеці можна дуже швидко розмістити дані та звільнити оперативку 
            //в купі складніше виділяти оперативку під дані, ще проблематичніше очистити оперативку
            //в С# очищенням оперативки займається garbage collecor

            //стек працює за принципом Last In First Out (LIFO)

            //value types (значущі) розміщуються у стеці
            //struct, enum

            //reference types (посилальні) - у керованій купі
            //class

            int a = 5; 
            System.Int32 b = 5;
            //struct, тому - в стеці

            Random random = new Random();
            //class, тому - в купі

            int[] arr = new int[10];
            //struct типу Int32
            //всі масиви - наслідують клас Array, то всі масиви є посилальними типами
            //тобто - керована купа

            //ConsoleKey
            //enum - стек

            //структури та енами унаслідовані від типу System.ValueType, тому вони в стеці
            //класи не унаслідовані від типу System.ValueType, тому керована купа

            //виконання програми на платформі .net реалізовано так, що всі ValueType розташовані в стеці

            //пам'ять під value types очищується після в момент залишення свого контексту виконання (область видимості)


            {
                int c = 2;
                int[] d = new int[10];
            }
            //пам'ять під c звільнилась 

            //у змінну d повернеться адрес
            //в керованій купі, де знаходиться масив
            //це фактично посилання
            //після виходу з області видимості посилання на пам'ять в d видалиться,
            //проте виділена пам'ять залишиться до відпрацювання garbage collection


            int h = 10;
            int j;
            j = h;
            //в стеці h = 10
            //в стеці j = 10


            int[] arr2 = new int[10];
            int[] arr3;
            arr3 = arr2;
            //в стеці arr2(ref) та arr3(ref) - посилання на керовану купу
            //в купі a(DATA) - реальні дані масиву
            //тобто arr2 і arr3 посилаються на одні й ті ж дані в купі


            int k = 1;
            Foo(k); 
            //ось тут дані з k копіюються в локальний параметр Foo
            Console.WriteLine(k);
            //вийде 1, а не 5
            //int - структура (value types), тому значення в стеці
            //змінні передаються по значенню, тому копіюються реальні дані


            int[] arr4 = new int[1];
            arr4[0] = 1; 
            Bar(arr4);
            Console.WriteLine(arr4[0]);
            //вийде 5, а не 1
            //масив - посилальний тип (reference types)
            //присвоюються не змінні, а посилання на одні й ті самі дані в купі
        }
    }
}
